Revit 2026 API

# WorksetTable Methods

---

The WorksetTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanDeleteWorkset | Indicates if a workset can be deleted. |
|  | DeleteWorkset | Delete the specific workset. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetActiveWorksetId | Returns the active workset's WorksetId. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetWorkset(Guid) | Returns the workset from a input Guid. |
|  | GetWorkset(WorksetId) | Returns the workset from a input WorksetId. |
|  | IsWorksetNameUnique | Checks if the given workset name is unique in the document. |
|  | RenameWorkset | Renames the workset. |
|  | SetActiveWorksetId | Sets the active workset. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

WorksetTable Class

Autodesk.Revit.DB Namespace